tutorials/rhoPisoFoam/ras/cavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // Solver for the rho equation
    rho PCG
    {
        preconditioner   DIC;
        tolerance        1e-05;
        relTol           0;
    };
    // Solver for the U equation
    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    // Solver for the p equation
    p PCG
    {
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
    // Solver for the h equation
    h PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    // Solver for the R equation
    R PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    // Solver for the k equation
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    // Solver for the epsilon equation
    epsilon PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    // Solver for the omega equation
    omega PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
}

PISO
{
    // Number of PISO correctors
    nCorrectors     2;
    // Number of non-orthogonal correctors
    nNonOrthogonalCorrectors 0;
    // momentumPredictor?
    momentumPredictor yes;
}

// ************************************************************************* //
